tutorials/multiRegion/CHT/reverseBurner/0/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [temperature];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    external
    {
        type            externalTemperature;
        h               1e3 [W/m^2/K];
        Ta              $internalField;
        value           $internalField;
    }
    solid_to_gas
    {
        type            coupledTemperature;
        value           $internalField;
        qrNbr           qr;
    }
}


// ************************************************************************* //
